Ran Plan for project: `prod` dir: `etc/terraform/environments` workspace: `prod`

<details><summary>Show Output</summary>

```diff
Initializing modules...
Downloading git::git@github.com:holaluz/kraken.git for alb...
- alb in .terraform/modules/alb/aws/ec2/alb
- alb.aws_variables in .terraform/modules/alb/aws/variables
Downloading git::git@github.com:holaluz/kraken.git for aws_variables...
- aws_variables in .terraform/modules/aws_variables/aws/variables
Downloading git::git@github.com:holaluz/kraken.git for basic_dashboard...
- basic_dashboard in .terraform/modules/basic_dashboard/datadog/dashboards
- basic_dashboard.alb_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb
- basic_dashboard.alb_monitor.alb_4XX_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/4XX
- basic_dashboard.alb_monitor.alb_4XX_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.alb_monitor.alb_5XX_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/5XX
- basic_dashboard.alb_monitor.alb_5XX_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.alb_monitor.alb_latency_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/latency
- basic_dashboard.alb_monitor.alb_latency_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.alb_monitor.alb_request_count_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/request_count
- basic_dashboard.alb_monitor.alb_request_count_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_api in .terraform/modules/basic_dashboard/datadog/monitors/ec2
- basic_dashboard.ec2_monitor_asg_api.cpu in .terraform/modules/basic_dashboard/datadog/monitors/ec2/cpu
- basic_dashboard.ec2_monitor_asg_api.cpu.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_api.disk in .terraform/modules/basic_dashboard/datadog/monitors/ec2/disk
- basic_dashboard.ec2_monitor_asg_api.disk.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_crons in .terraform/modules/basic_dashboard/datadog/monitors/ec2
- basic_dashboard.ec2_monitor_asg_crons.cpu in .terraform/modules/basic_dashboard/datadog/monitors/ec2/cpu
- basic_dashboard.ec2_monitor_asg_crons.cpu.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_crons.disk in .terraform/modules/basic_dashboard/datadog/monitors/ec2/disk
- basic_dashboard.ec2_monitor_asg_crons.disk.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.rds_monitors in .terraform/modules/basic_dashboard/datadog/monitors/rds
- basic_dashboard.rds_monitors.cpu_usage in .terraform/modules/basic_dashboard/datadog/monitors/rds/cpu_usage
- basic_dashboard.rds_monitors.cpu_usage.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.rds_monitors.free_space_remaining in .terraform/modules/basic_dashboard/datadog/monitors/rds/free_space_remaining
- basic_dashboard.rds_monitors.free_space_remaining.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.rds_monitors.replica_lag in .terraform/modules/basic_dashboard/datadog/monitors/rds/replica_lag
- basic_dashboard.rds_monitors.replica_lag.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.supervisor_monitor_crons in .terraform/modules/basic_dashboard/datadog/monitors/supervisor
- basic_dashboard.supervisor_monitor_crons.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
Downloading git::git@github.com:holaluz/kraken.git for ecs_application...
- ecs_application in .terraform/modules/ecs_application/aws/ecs/ecs_cluster_single_service
- ecs_application.ecr in .terraform/modules/ecs_application/aws/ecr
- ecs_application.ecs_cluster in .terraform/modules/ecs_application/aws/ecs/ecs_cluster
- ecs_application.ecs_service in .terraform/modules/ecs_application/aws/ecs/ecs_service
- ecs_application.ecs_service.aws_variables in .terraform/modules/ecs_application/aws/variables
- ecs_application.ecs_service.cloudwatch_log_group in .terraform/modules/ecs_application/aws/cloudwatch/log_group
- ecs_application.ecs_task in .terraform/modules/ecs_application/aws/ecs/ecs_task
- ecs_application.ecs_task.iam_policy_to_access_needed_secrets in .terraform/modules/ecs_application/aws/iam/policy_secrets
- ecs_application.ecs_task.iam_policy_to_access_needed_secrets.aws_variables in .terraform/modules/ecs_application/aws/variables
Downloading git::git@github.com:holaluz/kraken.git for rds...
- rds in .terraform/modules/rds/aws/rds/postgresql
- rds.aws_variables in .terraform/modules/rds/aws/variables
- rds.db in .terraform/modules/rds/aws/rds/db
- rds.db.aws_variables in .terraform/modules/rds/aws/variables
- rds.db.bastion in .terraform/modules/rds/aws/ec2/instance
- rds.db.bastion.ami in .terraform/modules/rds/aws/ec2/ami
- rds.db.bastion.aws_variables in .terraform/modules/rds/aws/variables
- rds.db.bastion.cloud_init in .terraform/modules/rds/aws/ec2/cloud_init
- rds.db.bastion.iam in .terraform/modules/rds/aws/iam/instance
- rds.db.bastion.iam.instance_profile in .terraform/modules/rds/aws/iam/instance_profile
- rds.db.bastion.iam.instance_profile.aws_variables in .terraform/modules/rds/aws/variables
- rds.db.bastion.iam.instance_s3 in .terraform/modules/rds/aws/iam/instance_s3_bucket_path
- rds.db.bastion.iam.secrets in .terraform/modules/rds/aws/iam/policy_secrets
- rds.db.bastion.iam.secrets.aws_variables in .terraform/modules/rds/aws/variables
- rds.db.kms in .terraform/modules/rds/aws/kms
- rds.db.rds_variables in .terraform/modules/rds/aws/rds/variables

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding datadog/datadog versions matching "~> 3.1"...
- Finding hashicorp/aws versions matching "~> 3.0, ~> 3.64"...
- Finding hashicorp/template versions matching "~> 2.1"...
- Finding hashicorp/random versions matching "~> 3.1"...
- Finding hashicorp/local versions matching "~> 2.1"...
- Installing hashicorp/template v2.2.0...
- Installed hashicorp/template v2.2.0 (signed by HashiCorp)
- Installing hashicorp/random v3.2.0...
- Installed hashicorp/random v3.2.0 (signed by HashiCorp)
- Installing hashicorp/local v2.2.3...
- Installed hashicorp/local v2.2.3 (signed by HashiCorp)
- Installing datadog/datadog v3.12.0...
- Installed datadog/datadog v3.12.0 (signed by a HashiCorp partner, key ID FB70BE941301C3EA)
- Installing hashicorp/aws v3.75.2...
- Installed hashicorp/aws v3.75.2 (signed by HashiCorp)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Switched to workspace "prod".

Downloading git::git@github.com:holaluz/kraken.git for alb...
- alb in .terraform/modules/alb/aws/ec2/alb
- alb.aws_variables in .terraform/modules/alb/aws/variables
Downloading git::git@github.com:holaluz/kraken.git for aws_variables...
- aws_variables in .terraform/modules/aws_variables/aws/variables
Downloading git::git@github.com:holaluz/kraken.git for basic_dashboard...
- basic_dashboard in .terraform/modules/basic_dashboard/datadog/dashboards
- basic_dashboard.alb_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb
- basic_dashboard.alb_monitor.alb_4XX_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/4XX
- basic_dashboard.alb_monitor.alb_4XX_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.alb_monitor.alb_5XX_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/5XX
- basic_dashboard.alb_monitor.alb_5XX_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.alb_monitor.alb_latency_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/latency
- basic_dashboard.alb_monitor.alb_latency_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.alb_monitor.alb_request_count_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/request_count
- basic_dashboard.alb_monitor.alb_request_count_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_api in .terraform/modules/basic_dashboard/datadog/monitors/ec2
- basic_dashboard.ec2_monitor_asg_api.cpu in .terraform/modules/basic_dashboard/datadog/monitors/ec2/cpu
- basic_dashboard.ec2_monitor_asg_api.cpu.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_api.disk in .terraform/modules/basic_dashboard/datadog/monitors/ec2/disk
- basic_dashboard.ec2_monitor_asg_api.disk.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_crons in .terraform/modules/basic_dashboard/datadog/monitors/ec2
- basic_dashboard.ec2_monitor_asg_crons.cpu in .terraform/modules/basic_dashboard/datadog/monitors/ec2/cpu
- basic_dashboard.ec2_monitor_asg_crons.cpu.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_crons.disk in .terraform/modules/basic_dashboard/datadog/monitors/ec2/disk
- basic_dashboard.ec2_monitor_asg_crons.disk.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.rds_monitors in .terraform/modules/basic_dashboard/datadog/monitors/rds
- basic_dashboard.rds_monitors.cpu_usage in .terraform/modules/basic_dashboard/datadog/monitors/rds/cpu_usage
- basic_dashboard.rds_monitors.cpu_usage.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.rds_monitors.free_space_remaining in .terraform/modules/basic_dashboard/datadog/monitors/rds/free_space_remaining
- basic_dashboard.rds_monitors.free_space_remaining.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.rds_monitors.replica_lag in .terraform/modules/basic_dashboard/datadog/monitors/rds/replica_lag
- basic_dashboard.rds_monitors.replica_lag.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.supervisor_monitor_crons in .terraform/modules/basic_dashboard/datadog/monitors/supervisor
- basic_dashboard.supervisor_monitor_crons.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
Downloading git::git@github.com:holaluz/kraken.git for ecs_application...
- ecs_application in .terraform/modules/ecs_application/aws/ecs/ecs_cluster_single_service
- ecs_application.ecr in .terraform/modules/ecs_application/aws/ecr
- ecs_application.ecs_cluster in .terraform/modules/ecs_application/aws/ecs/ecs_cluster
- ecs_application.ecs_service in .terraform/modules/ecs_application/aws/ecs/ecs_service
- ecs_application.ecs_service.aws_variables in .terraform/modules/ecs_application/aws/variables
- ecs_application.ecs_service.cloudwatch_log_group in .terraform/modules/ecs_application/aws/cloudwatch/log_group
- ecs_application.ecs_task in .terraform/modules/ecs_application/aws/ecs/ecs_task
- ecs_application.ecs_task.iam_policy_to_access_needed_secrets in .terraform/modules/ecs_application/aws/iam/policy_secrets
- ecs_application.ecs_task.iam_policy_to_access_needed_secrets.aws_variables in .terraform/modules/ecs_application/aws/variables
Downloading git::git@github.com:holaluz/kraken.git for rds...
- rds in .terraform/modules/rds/aws/rds/postgresql
- rds.aws_variables in .terraform/modules/rds/aws/variables
- rds.db in .terraform/modules/rds/aws/rds/db
- rds.db.aws_variables in .terraform/modules/rds/aws/variables
- rds.db.bastion in .terraform/modules/rds/aws/ec2/instance
- rds.db.bastion.ami in .terraform/modules/rds/aws/ec2/ami
- rds.db.bastion.aws_variables in .terraform/modules/rds/aws/variables
- rds.db.bastion.cloud_init in .terraform/modules/rds/aws/ec2/cloud_init
- rds.db.bastion.iam in .terraform/modules/rds/aws/iam/instance
- rds.db.bastion.iam.instance_profile in .terraform/modules/rds/aws/iam/instance_profile
- rds.db.bastion.iam.instance_profile.aws_variables in .terraform/modules/rds/aws/variables
- rds.db.bastion.iam.instance_s3 in .terraform/modules/rds/aws/iam/instance_s3_bucket_path
- rds.db.bastion.iam.secrets in .terraform/modules/rds/aws/iam/policy_secrets
- rds.db.bastion.iam.secrets.aws_variables in .terraform/modules/rds/aws/variables
- rds.db.kms in .terraform/modules/rds/aws/kms
- rds.db.rds_variables in .terraform/modules/rds/aws/rds/variables


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.ecs_application.module.ecs_task.aws_iam_role.task_role[0] has been changed
! resource "aws_iam_role" "task_role" {
        id                    = "ecs-execution-role-dragonite-prod"
        name                  = "ecs-execution-role-dragonite-prod"
        tags                  = {
            "Application" = "dragonite"
            "Deployment"  = "terraform"
            "Environment" = "prod"
            "Monitored"   = "datadog"
            "Name"        = "ecs-task-dragonite-prod"
            "Owner"       = "onefees"
        }
        # (9 unchanged attributes hidden)

+       inline_policy {
+           name   = "sqs-dragonite-prod-2462954851"
+           policy = jsonencode(
                {
+                   Statement = [
+                       {
+                           Action   = [
+                               "sqs:SendMessage",
+                               "sqs:ReceiveMessage",
+                               "sqs:GetQueueUrl",
+                               "sqs:GetQueueAttributes",
+                               "sqs:DeleteMessage",
                            ]
+                           Effect   = "Allow"
+                           Resource = "arn:aws:sqs:eu-west-1:165908609791:invoicing-dragonite-incoming-relation-prod.fifo"
+                           Sid      = ""
                        },
                    ]
+                   Version   = "2012-10-17"
                }
            )
        }
        # (2 unchanged blocks hidden)
    }
  # module.sqs_relations.aws_sqs_queue.sqs_queues["invoicing-dragonite-incoming-relation-prod.fifo"] has been changed
! resource "aws_sqs_queue" "sqs_queues" {
        id                                = "https://sqs.eu-west-1.amazonaws.com/165908609791/invoicing-dragonite-incoming-relation-prod.fifo"
        name                              = "invoicing-dragonite-incoming-relation-prod.fifo"
+       policy                            = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "SQS:SendMessage"
+                       Condition = {
+                           ArnEquals = {
+                               aws:SourceArn = "arn:aws:sns:eu-west-1:165908609791:engage-ate-relation-prod.fifo"
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = "*"
+                       Resource  = "arn:aws:sqs:eu-west-1:165908609791:invoicing-dragonite-incoming-relation-prod.fifo"
+                       Sid       = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
        tags                              = {
            "Application" = "dragonite"
            "Deployment"  = "terraform"
            "Environment" = "prod"
            "Monitored"   = "datadog"
            "Name"        = "dragonite-prod"
            "Owner"       = "onefees"
            "Resource"    = "sqs-queue"
        }
        # (15 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
! update in-place
- destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.sns_subscription.aws_sns_topic_subscription.sns_topic_subscription will be destroyed
- resource "aws_sns_topic_subscription" "sns_topic_subscription" {
-       arn                             = "arn:aws:sns:eu-west-1:165908609791:oak-generated-invoices-prod:36aecabb-1bdc-4fdc-aee8-e6911d19a4dc" -> null
-       confirmation_timeout_in_minutes = 1 -> null
-       confirmation_was_authenticated  = true -> null
-       endpoint                        = "arn:aws:sqs:eu-west-1:165908609791:invoicing-dragonite-incoming-invoices-prod" -> null
-       endpoint_auto_confirms          = true -> null
-       id                              = "arn:aws:sns:eu-west-1:165908609791:oak-generated-invoices-prod:36aecabb-1bdc-4fdc-aee8-e6911d19a4dc" -> null
-       owner_id                        = "165908609791" -> null
-       pending_confirmation            = false -> null
-       protocol                        = "sqs" -> null
-       raw_message_delivery            = true -> null
-       topic_arn                       = "arn:aws:sns:eu-west-1:165908609791:oak-generated-invoices-prod" -> null
    }

  # module.sns_subscription.aws_sqs_queue_policy.sns_events will be destroyed
- resource "aws_sqs_queue_policy" "sns_events" {
-       id        = "https://sqs.eu-west-1.amazonaws.com/165908609791/invoicing-dragonite-incoming-invoices-prod" -> null
-       policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "SQS:SendMessage"
-                       Condition = {
-                           ArnEquals = {
-                               aws:SourceArn = "arn:aws:sns:eu-west-1:165908609791:oak-generated-invoices-prod"
                            }
                        }
-                       Effect    = "Allow"
-                       Principal = "*"
-                       Resource  = "arn:aws:sqs:eu-west-1:165908609791:invoicing-dragonite-incoming-invoices-prod"
-                       Sid       = ""
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> null
-       queue_url = "https://sqs.eu-west-1.amazonaws.com/165908609791/invoicing-dragonite-incoming-invoices-prod" -> null
    }

  # module.sns_subscription_to_relations.aws_sns_topic_subscription.sns_topic_subscription will be destroyed
- resource "aws_sns_topic_subscription" "sns_topic_subscription" {
-       arn                             = "arn:aws:sns:eu-west-1:165908609791:engage-ate-relation-prod.fifo:c7f8930f-0046-4ec3-ad8b-bbeb1bfa4bd1" -> null
-       confirmation_timeout_in_minutes = 1 -> null
-       confirmation_was_authenticated  = true -> null
-       endpoint                        = "arn:aws:sqs:eu-west-1:165908609791:invoicing-dragonite-incoming-relation-prod.fifo" -> null
-       endpoint_auto_confirms          = true -> null
-       id                              = "arn:aws:sns:eu-west-1:165908609791:engage-ate-relation-prod.fifo:c7f8930f-0046-4ec3-ad8b-bbeb1bfa4bd1" -> null
-       owner_id                        = "165908609791" -> null
-       pending_confirmation            = false -> null
-       protocol                        = "sqs" -> null
-       raw_message_delivery            = true -> null
-       topic_arn                       = "arn:aws:sns:eu-west-1:165908609791:engage-ate-relation-prod.fifo" -> null
    }

  # module.sns_subscription_to_relations.aws_sqs_queue_policy.sns_events will be destroyed
- resource "aws_sqs_queue_policy" "sns_events" {
-       id        = "https://sqs.eu-west-1.amazonaws.com/165908609791/invoicing-dragonite-incoming-relation-prod.fifo" -> null
-       policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "SQS:SendMessage"
-                       Condition = {
-                           ArnEquals = {
-                               aws:SourceArn = "arn:aws:sns:eu-west-1:165908609791:engage-ate-relation-prod.fifo"
                            }
                        }
-                       Effect    = "Allow"
-                       Principal = "*"
-                       Resource  = "arn:aws:sqs:eu-west-1:165908609791:invoicing-dragonite-incoming-relation-prod.fifo"
-                       Sid       = ""
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> null
-       queue_url = "https://sqs.eu-west-1.amazonaws.com/165908609791/invoicing-dragonite-incoming-relation-prod.fifo" -> null
    }

  # module.sqs.aws_iam_role_policy.sqs_fullaccess will be destroyed
- resource "aws_iam_role_policy" "sqs_fullaccess" {
-       id     = "ecs-execution-role-dragonite-prod:sqs-dragonite-prod-3102853737" -> null
-       name   = "sqs-dragonite-prod-3102853737" -> null
-       policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "sqs:SendMessage",
-                           "sqs:ReceiveMessage",
-                           "sqs:GetQueueUrl",
-                           "sqs:GetQueueAttributes",
-                           "sqs:DeleteMessage",
                        ]
-                       Effect   = "Allow"
-                       Resource = "arn:aws:sqs:eu-west-1:165908609791:invoicing-dragonite-incoming-invoices-prod"
-                       Sid      = ""
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> null
-       role   = "ecs-execution-role-dragonite-prod" -> null
    }

  # module.sqs.aws_sqs_queue.dead_letter_queue[0] will be destroyed
- resource "aws_sqs_queue" "dead_letter_queue" {
-       arn                               = "arn:aws:sqs:eu-west-1:165908609791:DL-invoicing-dragonite-incoming-invoices-prod" -> null
-       content_based_deduplication       = false -> null
-       delay_seconds                     = 0 -> null
-       fifo_queue                        = false -> null
-       id                                = "https://sqs.eu-west-1.amazonaws.com/165908609791/DL-invoicing-dragonite-incoming-invoices-prod" -> null
-       kms_data_key_reuse_period_seconds = 300 -> null
-       max_message_size                  = 262144 -> null
-       message_retention_seconds         = 1209600 -> null
-       name                              = "DL-invoicing-dragonite-incoming-invoices-prod" -> null
-       receive_wait_time_seconds         = 0 -> null
-       sqs_managed_sse_enabled           = false -> null
-       tags                              = {
-           "Application" = "dragonite"
-           "Deployment"  = "terraform"
-           "Environment" = "prod"
-           "Monitored"   = "datadog"
-           "Name"        = "dragonite-prod"
-           "Owner"       = "onefees"
-           "Resource"    = "sqs-queue"
        } -> null
-       tags_all                          = {
-           "Application" = "dragonite"
-           "Deployment"  = "terraform"
-           "Environment" = "prod"
-           "Monitored"   = "datadog"
-           "Name"        = "dragonite-prod"
-           "Owner"       = "onefees"
-           "Resource"    = "sqs-queue"
        } -> null
-       url                               = "https://sqs.eu-west-1.amazonaws.com/165908609791/DL-invoicing-dragonite-incoming-invoices-prod" -> null
-       visibility_timeout_seconds        = 30 -> null
    }

  # module.sqs.aws_sqs_queue.sqs_queues["invoicing-dragonite-incoming-invoices-prod"] will be destroyed
- resource "aws_sqs_queue" "sqs_queues" {
-       arn                               = "arn:aws:sqs:eu-west-1:165908609791:invoicing-dragonite-incoming-invoices-prod" -> null
-       content_based_deduplication       = false -> null
-       delay_seconds                     = 0 -> null
-       fifo_queue                        = false -> null
-       id                                = "https://sqs.eu-west-1.amazonaws.com/165908609791/invoicing-dragonite-incoming-invoices-prod" -> null
-       kms_data_key_reuse_period_seconds = 300 -> null
-       max_message_size                  = 262144 -> null
-       message_retention_seconds         = 1209600 -> null
-       name                              = "invoicing-dragonite-incoming-invoices-prod" -> null
-       policy                            = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "SQS:SendMessage"
-                       Condition = {
-                           ArnEquals = {
-                               aws:SourceArn = "arn:aws:sns:eu-west-1:165908609791:oak-generated-invoices-prod"
                            }
                        }
-                       Effect    = "Allow"
-                       Principal = "*"
-                       Resource  = "arn:aws:sqs:eu-west-1:165908609791:invoicing-dragonite-incoming-invoices-prod"
-                       Sid       = ""
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> null
-       receive_wait_time_seconds         = 0 -> null
-       redrive_policy                    = jsonencode(
            {
-               deadLetterTargetArn = "arn:aws:sqs:eu-west-1:165908609791:DL-invoicing-dragonite-incoming-invoices-prod"
-               maxReceiveCount     = 10
            }
        ) -> null
-       sqs_managed_sse_enabled           = false -> null
-       tags                              = {
-           "Application" = "dragonite"
-           "Deployment"  = "terraform"
-           "Environment" = "prod"
-           "Monitored"   = "datadog"
-           "Name"        = "dragonite-prod"
-           "Owner"       = "onefees"
-           "Resource"    = "sqs-queue"
        } -> null
-       tags_all                          = {
-           "Application" = "dragonite"
-           "Deployment"  = "terraform"
-           "Environment" = "prod"
-           "Monitored"   = "datadog"
-           "Name"        = "dragonite-prod"
-           "Owner"       = "onefees"
-           "Resource"    = "sqs-queue"
        } -> null
-       url                               = "https://sqs.eu-west-1.amazonaws.com/165908609791/invoicing-dragonite-incoming-invoices-prod" -> null
-       visibility_timeout_seconds        = 30 -> null
    }

  # module.sqs_relations.aws_iam_role_policy.sqs_fullaccess will be destroyed
- resource "aws_iam_role_policy" "sqs_fullaccess" {
-       id     = "ecs-execution-role-dragonite-prod:sqs-dragonite-prod-2462954851" -> null
-       name   = "sqs-dragonite-prod-2462954851" -> null
-       policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "sqs:SendMessage",
-                           "sqs:ReceiveMessage",
-                           "sqs:GetQueueUrl",
-                           "sqs:GetQueueAttributes",
-                           "sqs:DeleteMessage",
                        ]
-                       Effect   = "Allow"
-                       Resource = "arn:aws:sqs:eu-west-1:165908609791:invoicing-dragonite-incoming-relation-prod.fifo"
-                       Sid      = ""
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> null
-       role   = "ecs-execution-role-dragonite-prod" -> null
    }

  # module.sqs_relations.aws_sqs_queue.dead_letter_queue[0] will be destroyed
- resource "aws_sqs_queue" "dead_letter_queue" {
-       arn                               = "arn:aws:sqs:eu-west-1:165908609791:DL-invoicing-dragonite-incoming-relation-prod.fifo" -> null
-       content_based_deduplication       = false -> null
-       deduplication_scope               = "queue" -> null
-       delay_seconds                     = 0 -> null
-       fifo_queue                        = true -> null
-       fifo_throughput_limit             = "perQueue" -> null
-       id                                = "https://sqs.eu-west-1.amazonaws.com/165908609791/DL-invoicing-dragonite-incoming-relation-prod.fifo" -> null
-       kms_data_key_reuse_period_seconds = 300 -> null
-       max_message_size                  = 262144 -> null
-       message_retention_seconds         = 1209600 -> null
-       name                              = "DL-invoicing-dragonite-incoming-relation-prod.fifo" -> null
-       receive_wait_time_seconds         = 0 -> null
-       sqs_managed_sse_enabled           = false -> null
-       tags                              = {
-           "Application" = "dragonite"
-           "Deployment"  = "terraform"
-           "Environment" = "prod"
-           "Monitored"   = "datadog"
-           "Name"        = "dragonite-prod"
-           "Owner"       = "onefees"
-           "Resource"    = "sqs-queue"
        } -> null
-       tags_all                          = {
-           "Application" = "dragonite"
-           "Deployment"  = "terraform"
-           "Environment" = "prod"
-           "Monitored"   = "datadog"
-           "Name"        = "dragonite-prod"
-           "Owner"       = "onefees"
-           "Resource"    = "sqs-queue"
        } -> null
-       url                               = "https://sqs.eu-west-1.amazonaws.com/165908609791/DL-invoicing-dragonite-incoming-relation-prod.fifo" -> null
-       visibility_timeout_seconds        = 30 -> null
    }

  # module.sqs_relations.aws_sqs_queue.sqs_queues["invoicing-dragonite-incoming-relation-prod.fifo"] will be destroyed
- resource "aws_sqs_queue" "sqs_queues" {
-       arn                               = "arn:aws:sqs:eu-west-1:165908609791:invoicing-dragonite-incoming-relation-prod.fifo" -> null
-       content_based_deduplication       = false -> null
-       deduplication_scope               = "queue" -> null
-       delay_seconds                     = 0 -> null
-       fifo_queue                        = true -> null
-       fifo_throughput_limit             = "perQueue" -> null
-       id                                = "https://sqs.eu-west-1.amazonaws.com/165908609791/invoicing-dragonite-incoming-relation-prod.fifo" -> null
-       kms_data_key_reuse_period_seconds = 300 -> null
-       max_message_size                  = 262144 -> null
-       message_retention_seconds         = 1209600 -> null
-       name                              = "invoicing-dragonite-incoming-relation-prod.fifo" -> null
-       policy                            = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "SQS:SendMessage"
-                       Condition = {
-                           ArnEquals = {
-                               aws:SourceArn = "arn:aws:sns:eu-west-1:165908609791:engage-ate-relation-prod.fifo"
                            }
                        }
-                       Effect    = "Allow"
-                       Principal = "*"
-                       Resource  = "arn:aws:sqs:eu-west-1:165908609791:invoicing-dragonite-incoming-relation-prod.fifo"
-                       Sid       = ""
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> null
-       receive_wait_time_seconds         = 0 -> null
-       redrive_policy                    = jsonencode(
            {
-               deadLetterTargetArn = "arn:aws:sqs:eu-west-1:165908609791:DL-invoicing-dragonite-incoming-relation-prod.fifo"
-               maxReceiveCount     = 10
            }
        ) -> null
-       sqs_managed_sse_enabled           = false -> null
-       tags                              = {
-           "Application" = "dragonite"
-           "Deployment"  = "terraform"
-           "Environment" = "prod"
-           "Monitored"   = "datadog"
-           "Name"        = "dragonite-prod"
-           "Owner"       = "onefees"
-           "Resource"    = "sqs-queue"
        } -> null
-       tags_all                          = {
-           "Application" = "dragonite"
-           "Deployment"  = "terraform"
-           "Environment" = "prod"
-           "Monitored"   = "datadog"
-           "Name"        = "dragonite-prod"
-           "Owner"       = "onefees"
-           "Resource"    = "sqs-queue"
        } -> null
-       url                               = "https://sqs.eu-west-1.amazonaws.com/165908609791/invoicing-dragonite-incoming-relation-prod.fifo" -> null
-       visibility_timeout_seconds        = 30 -> null
    }

  # module.ecs_application.module.ecs_service.aws_ecs_service.this will be updated in-place
! resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:eu-west-1:165908609791:service/dragonite-prod/dragonite-prod"
        name                               = "dragonite-prod"
        tags                               = {
            "Application" = "dragonite"
            "Deployment"  = "terraform"
            "Environment" = "prod"
            "Monitored"   = "datadog"
            "Name"        = "dragonite-prod"
            "Owner"       = "onefees"
            "Resource"    = "ecs-service"
        }
        # (15 unchanged attributes hidden)




!       network_configuration {
!           security_groups  = [
-               "sg-0c7fca56b5da325c5",
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }
        # (3 unchanged blocks hidden)
    }

  # module.rds.module.db.data.aws_kms_key.this will be read during apply
  # (config refers to values not yet known)
 <= data "aws_kms_key" "this"  {
+       arn                        = (known after apply)
+       aws_account_id             = (known after apply)
+       creation_date              = (known after apply)
+       customer_master_key_spec   = (known after apply)
+       deletion_date              = (known after apply)
+       description                = (known after apply)
+       enabled                    = (known after apply)
+       expiration_model           = (known after apply)
+       id                         = (known after apply)
+       key_id                     = "alias/dragonite-prod-rds"
+       key_manager                = (known after apply)
+       key_state                  = (known after apply)
+       key_usage                  = (known after apply)
+       multi_region               = (known after apply)
+       multi_region_configuration = (known after apply)
+       origin                     = (known after apply)
+       valid_to                   = (known after apply)
    }

  # module.rds.module.db.aws_db_instance.rds will be created
+ resource "aws_db_instance" "rds" {
+       address                               = (known after apply)
+       allocated_storage                     = 10
+       apply_immediately                     = true
+       arn                                   = (known after apply)
+       auto_minor_version_upgrade            = true
+       availability_zone                     = (known after apply)
+       backup_retention_period               = 10
+       backup_window                         = "00:00-02:00"
+       ca_cert_identifier                    = "rds-ca-2019"
+       character_set_name                    = (known after apply)
+       copy_tags_to_snapshot                 = true
+       db_subnet_group_name                  = (known after apply)
+       delete_automated_backups              = true
+       deletion_protection                   = true
+       enabled_cloudwatch_logs_exports       = [
+           "postgresql",
+           "upgrade",
        ]
+       endpoint                              = (known after apply)
+       engine                                = "postgres"
+       engine_version                        = "13.3"
+       engine_version_actual                 = (known after apply)
+       final_snapshot_identifier             = "dragonite-prod-final"
+       hosted_zone_id                        = (known after apply)
+       id                                    = (known after apply)
+       identifier                            = "dragonite-prod"
+       identifier_prefix                     = (known after apply)
+       instance_class                        = "db.t3.micro"
+       kms_key_id                            = (known after apply)
+       latest_restorable_time                = (known after apply)
+       license_model                         = (known after apply)
+       maintenance_window                    = "sat:02:00-sat:04:00"
+       monitoring_interval                   = 60
+       monitoring_role_arn                   = "arn:aws:iam::165908609791:role/rds-monitoring-role"
+       multi_az                              = true
+       name                                  = (known after apply)
+       nchar_character_set_name              = (known after apply)
+       option_group_name                     = (known after apply)
+       parameter_group_name                  = (known after apply)
+       password                              = (sensitive value)
+       performance_insights_enabled          = true
+       performance_insights_kms_key_id       = "arn:aws:kms:eu-west-1:165908609791:key/5aee8a46-fce0-4a45-85a8-3069702b3296"
+       performance_insights_retention_period = (known after apply)
+       port                                  = (known after apply)
+       publicly_accessible                   = false
+       replicas                              = (known after apply)
+       resource_id                           = (known after apply)
+       skip_final_snapshot                   = false
+       snapshot_identifier                   = (known after apply)
+       status                                = (known after apply)
+       storage_encrypted                     = true
+       storage_type                          = (known after apply)
+       tags                                  = {
+           "Application" = "dragonite"
+           "Backup"      = "daily"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Monitored"   = "datadog"
+           "Name"        = "dragonite-prod-rds"
+           "Owner"       = "onefees"
+           "Resource"    = "rds"
        }
+       tags_all                              = {
+           "Application" = "dragonite"
+           "Backup"      = "daily"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Monitored"   = "datadog"
+           "Name"        = "dragonite-prod-rds"
+           "Owner"       = "onefees"
+           "Resource"    = "rds"
        }
+       timezone                              = (known after apply)
+       username                              = (known after apply)
+       vpc_security_group_ids                = (known after apply)
    }

  # module.rds.module.db.aws_db_subnet_group.rds will be created
+ resource "aws_db_subnet_group" "rds" {
+       arn         = (known after apply)
+       description = "DB subnet group for dragonite-prod RDS."
+       id          = (known after apply)
+       name        = "dragonite-prod"
+       name_prefix = (known after apply)
+       subnet_ids  = [
+           "subnet-08178094b64355e92",
+           "subnet-0847317e984ba5111",
+           "subnet-0f7ee5b76673dadae",
        ]
+       tags        = {
+           "Application" = "dragonite"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Monitored"   = "datadog"
+           "Name"        = "dragonite-prod-rds"
+           "Owner"       = "onefees"
+           "Resource"    = "subnet-group"
        }
+       tags_all    = {
+           "Application" = "dragonite"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Monitored"   = "datadog"
+           "Name"        = "dragonite-prod-rds"
+           "Owner"       = "onefees"
+           "Resource"    = "subnet-group"
        }
    }

  # module.rds.module.db.aws_route53_record.main will be created
+ resource "aws_route53_record" "main" {
+       allow_overwrite = (known after apply)
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "dragonite-prod.db.clidom.es"
+       records         = (known after apply)
+       ttl             = 300
+       type            = "CNAME"
+       zone_id         = "Z3VBSH4Z3N3V93"
    }

  # module.rds.module.db.aws_secretsmanager_secret.this will be created
+ resource "aws_secretsmanager_secret" "this" {
+       arn                            = (known after apply)
+       description                    = "Credentials for dragonite-prod RDS database."
+       force_overwrite_replica_secret = false
+       id                             = (known after apply)
+       name                           = "dragonite-prod-rds"
+       name_prefix                    = (known after apply)
+       policy                         = (known after apply)
+       recovery_window_in_days        = 30
+       rotation_enabled               = (known after apply)
+       rotation_lambda_arn            = (known after apply)
+       tags                           = {
+           "Application" = "dragonite"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Name"        = "dragonite-prod-rds"
+           "Resource"    = "secret"
        }
+       tags_all                       = {
+           "Application" = "dragonite"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Name"        = "dragonite-prod-rds"
+           "Resource"    = "secret"
        }

+       replica {
+           kms_key_id         = (known after apply)
+           last_accessed_date = (known after apply)
+           region             = (known after apply)
+           status             = (known after apply)
+           status_message     = (known after apply)
        }

+       rotation_rules {
+           automatically_after_days = (known after apply)
        }
    }

  # module.rds.module.db.aws_secretsmanager_secret_version.this will be created
+ resource "aws_secretsmanager_secret_version" "this" {
+       arn            = (known after apply)
+       id             = (known after apply)
+       secret_id      = (known after apply)
+       secret_string  = (sensitive value)
+       version_id     = (known after apply)
+       version_stages = (known after apply)
    }

  # module.rds.module.db.aws_security_group.access_to_rds will be created
+ resource "aws_security_group" "access_to_rds" {
+       arn                    = (known after apply)
+       description            = "Instances with this group attached will have access to RDS dragonite-prod"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = "access-dragonite-prod-rds"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Application" = "dragonite"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Name"        = "access-dragonite-prod-rds"
+           "Owner"       = "onefees"
+           "Resource"    = "security-group"
        }
+       tags_all               = {
+           "Application" = "dragonite"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Name"        = "access-dragonite-prod-rds"
+           "Owner"       = "onefees"
+           "Resource"    = "security-group"
        }
+       vpc_id                 = "vpc-f504e990"
    }

  # module.rds.module.db.aws_security_group.rds will be created
+ resource "aws_security_group" "rds" {
+       arn                    = (known after apply)
+       description            = "Security group for dragonite-prod RDS."
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = []
+               description      = "postgres port"
+               from_port        = 5432
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = (known after apply)
+               self             = false
+               to_port          = 5432
            },
        ]
+       name                   = "dragonite-prod-rds"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Application" = "dragonite"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Monitored"   = "datadog"
+           "Name"        = "dragonite-prod-rds"
+           "Owner"       = "onefees"
+           "Resource"    = "security-group"
        }
+       tags_all               = {
+           "Application" = "dragonite"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Monitored"   = "datadog"
+           "Name"        = "dragonite-prod-rds"
+           "Owner"       = "onefees"
+           "Resource"    = "security-group"
        }
+       vpc_id                 = "vpc-f504e990"
    }

  # module.rds.module.db.random_password.password will be created
+ resource "random_password" "password" {
+       bcrypt_hash      = (sensitive value)
+       id               = (known after apply)
+       length           = 41
+       lower            = true
+       min_lower        = 0
+       min_numeric      = 0
+       min_special      = 0
+       min_upper        = 0
+       number           = true
+       override_special = "!#$%&*()-_=+[]{}<>:?"
+       result           = (sensitive value)
+       special          = true
+       upper            = true
    }

  # module.rds.module.db.random_string.username will be created
+ resource "random_string" "username" {
+       id          = (known after apply)
+       length      = 16
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = false
+       result      = (known after apply)
+       special     = false
+       upper       = true
    }

  # module.rds.module.db.module.bastion.aws_instance.instance will be created
+ resource "aws_instance" "instance" {
+       ami                                  = "ami-0e788c3d8f65ca919"
+       arn                                  = (known after apply)
+       associate_public_ip_address          = (known after apply)
+       availability_zone                    = (known after apply)
+       cpu_core_count                       = (known after apply)
+       cpu_threads_per_core                 = (known after apply)
+       disable_api_termination              = false
+       ebs_optimized                        = true
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       iam_instance_profile                 = (known after apply)
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = "t3.micro"
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = (known after apply)
+       monitoring                           = (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_partition_number           = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       source_dest_check                    = true
+       subnet_id                            = (known after apply)
+       tags                                 = {
+           "Application" = "bastion-dragonite"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Monitored"   = "datadog"
+           "Name"        = "bastion-dragonite-prod"
+           "OS"          = "Ubuntu"
+           "Platform"    = "linux"
+           "Resource"    = "ec2"
+           "Version"     = "18.04"
        }
+       tags_all                             = {
+           "Application" = "bastion-dragonite"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Monitored"   = "datadog"
+           "Name"        = "bastion-dragonite-prod"
+           "OS"          = "Ubuntu"
+           "Platform"    = "linux"
+           "Resource"    = "ec2"
+           "Version"     = "18.04"
        }
+       tenancy                              = (known after apply)
+       user_data                            = "ca51d14b32b0f59739e4672f7fc595ba3b341445"
+       user_data_base64                     = (known after apply)
+       vpc_security_group_ids               = (known after apply)

+       capacity_reservation_specification {
+           capacity_reservation_preference = (known after apply)

+           capacity_reservation_target {
+               capacity_reservation_id = (known after apply)
            }
        }

+       credit_specification {
+           cpu_credits = "standard"
        }

+       ebs_block_device {
+           delete_on_termination = (known after apply)
+           device_name           = (known after apply)
+           encrypted             = (known after apply)
+           iops                  = (known after apply)
+           kms_key_id            = (known after apply)
+           snapshot_id           = (known after apply)
+           tags                  = (known after apply)
+           throughput            = (known after apply)
+           volume_id             = (known after apply)
+           volume_size           = (known after apply)
+           volume_type           = (known after apply)
        }

+       enclave_options {
+           enabled = (known after apply)
        }

+       ephemeral_block_device {
+           device_name  = (known after apply)
+           no_device    = (known after apply)
+           virtual_name = (known after apply)
        }

+       metadata_options {
+           http_endpoint               = (known after apply)
+           http_put_response_hop_limit = (known after apply)
+           http_tokens                 = (known after apply)
+           instance_metadata_tags      = (known after apply)
        }

+       network_interface {
+           delete_on_termination = (known after apply)
+           device_index          = (known after apply)
+           network_interface_id  = (known after apply)
        }

+       root_block_device {
+           delete_on_termination = true
+           device_name           = (known after apply)
+           encrypted             = true
+           iops                  = (known after apply)
+           kms_key_id            = (known after apply)
+           tags                  = {
+               "Application" = "bastion-dragonite"
+               "Deployment"  = "terraform"
+               "Environment" = "prod"
+               "Monitored"   = "datadog"
+               "Name"        = "bastion-dragonite-prod"
+               "Resource"    = "volume"
            }
+           throughput            = 125
+           volume_id             = (known after apply)
+           volume_size           = 8
+           volume_type           = "gp3"
        }
    }

  # module.rds.module.db.module.bastion.aws_route53_record.instance will be created
+ resource "aws_route53_record" "instance" {
+       allow_overwrite = (known after apply)
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "dragonite.bastion.clidom.es"
+       records         = (known after apply)
+       ttl             = 300
+       type            = "A"
+       zone_id         = "Z3VBSH4Z3N3V93"
    }

  # module.rds.module.db.module.bastion.aws_security_group.instance will be created
+ resource "aws_security_group" "instance" {
+       arn                    = (known after apply)
+       description            = "Security group for bastion-dragonite-prod instance."
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "All traffic allowed."
+               from_port        = 0
+               ipv6_cidr_blocks = [
+                   "::/0",
                ]
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "10.64.0.0/16",
                ]
+               description      = "SSH port open to office computers and VPN."
+               from_port        = 22
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = [
+                   "sg-0e1f4db7282f2ad59",
                ]
+               self             = false
+               to_port          = 22
            },
        ]
+       name                   = "bastion-dragonite-prod-instance"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Application" = "bastion-dragonite"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Monitored"   = "datadog"
+           "Name"        = "bastion-dragonite-prod-instance"
+           "Resource"    = "security-group"
        }
+       tags_all               = {
+           "Application" = "bastion-dragonite"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Monitored"   = "datadog"
+           "Name"        = "bastion-dragonite-prod-instance"
+           "Resource"    = "security-group"
        }
+       vpc_id                 = "vpc-f504e990"
    }

  # module.rds.module.db.module.bastion.random_shuffle.subnet_private_id will be created
+ resource "random_shuffle" "subnet_private_id" {
+       id           = (known after apply)
+       input        = [
+           "subnet-08178094b64355e92",
+           "subnet-0847317e984ba5111",
+           "subnet-0f7ee5b76673dadae",
        ]
+       result       = (known after apply)
+       result_count = 1
    }

  # module.rds.module.db.module.kms[0].aws_kms_alias.this will be created
+ resource "aws_kms_alias" "this" {
+       arn            = (known after apply)
+       id             = (known after apply)
+       name           = "alias/dragonite-prod-rds"
+       name_prefix    = (known after apply)
+       target_key_arn = (known after apply)
+       target_key_id  = (known after apply)
    }

  # module.rds.module.db.module.kms[0].aws_kms_key.this will be created
+ resource "aws_kms_key" "this" {
+       arn                                = (known after apply)
+       bypass_policy_lockout_safety_check = false
+       customer_master_key_spec           = "SYMMETRIC_DEFAULT"
+       deletion_window_in_days            = 7
+       description                        = "KMS for dragonite-prod RDS."
+       enable_key_rotation                = true
+       id                                 = (known after apply)
+       is_enabled                         = true
+       key_id                             = (known after apply)
+       key_usage                          = "ENCRYPT_DECRYPT"
+       multi_region                       = false
+       policy                             = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "kms:*"
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS = [
+                               "arn:aws:iam::196353230095:root",
+                               "arn:aws:iam::165908609791:root",
                            ]
                        }
+                       Resource  = "*"
+                       Sid       = ""
                    },
+                   {
+                       Action    = [
+                           "kms:ReEncrypt*",
+                           "kms:GenerateDataKey*",
+                           "kms:Encrypt",
+                           "kms:DescribeKey",
+                           "kms:Decrypt",
                        ]
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS = "arn:aws:iam::387058954869:root"
                        }
+                       Resource  = "*"
+                       Sid       = ""
                    },
+                   {
+                       Action    = [
+                           "kms:RevokeGrant",
+                           "kms:ListGrants",
+                           "kms:CreateGrant",
                        ]
+                       Condition = {
+                           Bool = {
+                               kms:GrantIsForAWSResource = "true"
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS = "arn:aws:iam::387058954869:root"
                        }
+                       Resource  = "*"
+                       Sid       = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       tags                               = {
+           "Application" = "dragonite"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Name"        = "dragonite-prod"
+           "Resource"    = "kms-key"
        }
+       tags_all                           = {
+           "Application" = "dragonite"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Name"        = "dragonite-prod"
+           "Resource"    = "kms-key"
        }
    }

  # module.rds.module.db.module.bastion.module.iam.module.instance_profile.aws_iam_instance_profile.instance will be created
+ resource "aws_iam_instance_profile" "instance" {
+       arn         = (known after apply)
+       create_date = (known after apply)
+       id          = (known after apply)
+       name        = "bastion-dragonite-prod"
+       path        = "/"
+       role        = "bastion-dragonite-prod"
+       tags_all    = (known after apply)
+       unique_id   = (known after apply)
    }

  # module.rds.module.db.module.bastion.module.iam.module.instance_profile.aws_iam_role.instance will be created
+ resource "aws_iam_role" "instance" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ec2.amazonaws.com"
                        }
+                       Sid       = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       description           = "Role for bastion-dragonite-prod instances."
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "bastion-dragonite-prod"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.rds.module.db.module.bastion.module.iam.module.instance_profile.aws_iam_role_policy.ec2_describe_tags will be created
+ resource "aws_iam_role_policy" "ec2_describe_tags" {
+       id     = (known after apply)
+       name   = "ec2-describe-tags"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = "ec2:DescribeTags"
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role   = (known after apply)
    }

  # module.rds.module.db.module.bastion.module.iam.module.instance_profile.aws_iam_role_policy_attachment.sessionmanager-s3-ec2-policy-attach will be created
+ resource "aws_iam_role_policy_attachment" "sessionmanager-s3-ec2-policy-attach" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::165908609791:policy/hlz-sessionmanager-s3-ec2-policy"
+       role       = "bastion-dragonite-prod"
    }

  # module.rds.module.db.module.bastion.module.iam.module.instance_profile.aws_iam_role_policy_attachment.sessionmanager-ssm-ec2-policy-attach will be created
+ resource "aws_iam_role_policy_attachment" "sessionmanager-ssm-ec2-policy-attach" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
+       role       = "bastion-dragonite-prod"
    }

  # module.rds.module.db.module.bastion.module.iam.module.instance_s3.aws_iam_role_policy.instance_s3 will be created
+ resource "aws_iam_role_policy" "instance_s3" {
+       id     = (known after apply)
+       name   = "holaluz-apps-bastion-dragonite-prod-s3"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = "s3:ListBucket"
+                       Effect   = "Allow"
+                       Resource = "arn:aws:s3:::holaluz-apps"
+                       Sid      = ""
                    },
+                   {
+                       Action   = [
+                           "s3:PutObjectAcl",
+                           "s3:PutObject",
+                           "s3:GetObjectVersion",
+                           "s3:GetObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = "arn:aws:s3:::holaluz-apps/bastion-dragonite/prod/*"
+                       Sid      = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role   = (known after apply)
    }

  # module.rds.module.db.module.bastion.module.iam.module.secrets.aws_iam_role_policy.this will be created
+ resource "aws_iam_role_policy" "this" {
+       id     = (known after apply)
+       name   = "bastion-dragonite-prod-secrets"
+       policy = jsonencode(
            {
+  
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.